app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    #@users = Friendship.where(user_id: current_user)
    @users = User.paginate(:page => params[:page], :per_page => 5)

UPDATE "users" SET "email" = $1, "reset_password_token" = $2, "reset_password_sent_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["email", "ricardow@ricardo.com"], ["reset_password_token", nil], ["reset_password_sent_at", nil], ["updated_at", "2015-09-05 13:36:15.142125"], ["id", 1]]
---
  def update
    respond_to do |format|
      if user_params[:password].blank?
        @user.update_without_password(user_params_without_password)