app/controllers/users_controller.rb

  def index
    @users = Friendship.where(user_id: current_user)
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 2]]